tutorials/combustion/fireFoam/LES/oppositeBurningPanels/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ground
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    burner
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(top|sides)"
    {
        type            prghTotalHydrostaticPressure;
        p0              $internalField;
        value           $internalField;
    }

    "(region0_to.*)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
